// import { useSelector } from 'react-redux';
import { 

 } from "./AboutUsPage.styled";

// import { selectLanguages } from 'redux/selectors';
// import lang from 'assets/json/language.json';

const AboutUsPage = () => {
  // const languages = useSelector(selectLanguages);


  return (
    <>
      {/* <p>About Us page</p>
      <h2
        style={{ margin: '50px auto', textAlign: 'center', fontSize: '50px' }}
      >
        Page under construction
      </h2> */}
      <h1>О нас: Мы - ваш надежный партнер в мире электротоваров</h1>
      <p>
        Добро пожаловать в <spen>Electro world </spen>, вашу надежную точку в
        мире электротоваров и комплектующих к ним. Мы являемся ведущими
        специалистами в отрасли, обеспечивая наших клиентов широким
        ассортиментом продукции высочайшего качества по конкурентоспособным
        ценам.
      </p>
      <p>
        <b>Наша миссия:</b>
      </p>
      <p>
        Мы стремимся обеспечить наших клиентов совершенными продуктами и
        выдающимися услугами, превосходя их ожидания в каждом аспекте нашего
        бизнеса.
      </p>
      <p>
        <b>Наши преимущества:</b>
      </p>
      <ul>
        <li>
          Широкий ассортимент продукции от ведущих мировых производителей.
        </li>
        <li>
          Высокое качество продукции, подтвержденное многолетним опытом и
          отзывами клиентов.
        </li>
        <li>
          Конкурентоспособные цены и гибкая система скидок для наших постоянных
          клиентов.
        </li>
        <li>
          Профессиональная команда консультантов, готовых предоставить вам
          экспертную помощь и советы.
        </li>
      </ul>
      <p>
        <b>Наша история:</b>
      </p>
      <p>
        <spen>Electro world </spen> был основан в 2012 году, с твердым
        убеждением в том, что технологии могут сделать мир лучше. С тех пор мы
        стремимся предоставлять нашим клиентам только лучшие продукты и услуги,
        соответствующие самым высоким стандартам качества и инноваций.
      </p>
      <p>
        <b>Наши ценности:</b>
      </p>
      <p>
        В <spen>Electro world </spen> мы ценим доверие наших клиентов, честность
        в деловых отношениях и постоянное стремление к совершенствованию.
      </p>
      <p>Особое внимание мы уделяем:</p>
      <ul>
        <li>
          Постоянному мониторингу за последними тенденциями и разработками в
          отрасли, что позволяет предлогать нашим клиентам самые передовые
          решения.
        </li>
        <li>
          Качеству нашей продукции и услуг, которым мы гордимся, и которое
          обеспечивая надежность и долговечность в каждом изделии.
        </li>
        <li>
          Обслуживанию клиентов, предоставляя отличное обслуживание и
          индивидуальный подход к каждому.
        </li>
      </ul>
      <p>
        <b>Связаться с нами:</b>
      </p>
      <p>
        Мы готовы ответить на любые ваши вопросы и предоставить необходимую
        помощь. Свяжитесь с нами сегодня, и мы с удовольствием поможем вам найти
        идеальное решение для ваших потребностей.
      </p>
      <p>Дайте нам шанс превзойти ваши ожидания.</p>
    </>
  );
};

export default AboutUsPage;

// Вариант 1: "О нас"
// Заголовок:
// "О нас: Мы - ваш надежный партнер в мире электротоваров"

// Текст:
// "Добро пожаловать в [название вашего магазина], вашу надежную точку в мире электротоваров и комплектующих к ним. Мы являемся ведущими специалистами в отрасли, обеспечивая наших клиентов широким ассортиментом продукции высочайшего качества по конкурентоспособным ценам.

// Наша миссия:
// Мы стремимся обеспечить наших клиентов совершенными продуктами и выдающимися услугами, превосходя их ожидания в каждом аспекте нашего бизнеса.

// Наши преимущества:

// Широкий ассортимент продукции от ведущих мировых производителей.
// Высокое качество продукции, подтвержденное многолетним опытом и отзывами клиентов.
// Конкурентоспособные цены и гибкая система скидок для наших постоянных клиентов.
// Профессиональная команда консультантов, готовых предоставить вам экспертную помощь и советы.
// Наши ценности:
// В [название вашего магазина] мы ценим доверие наших клиентов, честность в деловых отношениях и постоянное стремление к совершенствованию.

// Связаться с нами:
// Мы готовы ответить на любые ваши вопросы и предоставить необходимую помощь. Свяжитесь с нами сегодня, и мы с удовольствием поможем вам найти идеальное решение для ваших потребностей в электротоварах.

// Подвал:
// © [Название вашего магазина] [Год]. Все права защищены.

// Вариант 2: "О нас"
// Заголовок:
// "О нас: Инновации в мире электротехники"

// Текст:
// "Добро пожаловать в [название вашего магазина], вашего надежного партнера в сфере электротоваров и комплектующих к ним. Мы - команда энтузиастов, посвятивших свою жизнь созданию инновационных решений в области электротехники.

// Наша история:
// [Название вашего магазина] был основан в [год], с твердым убеждением в том, что технологии могут сделать мир лучше. С тех пор мы стремимся предоставлять нашим клиентам только лучшие продукты и услуги, соответствующие самым высоким стандартам качества и инноваций.

// Наша миссия:
// Наша миссия - делать технологии доступными и понятными для всех, обеспечивая инновационные и эффективные решения в сфере электротехники.

// Наши ценности:

// Инновации: Мы постоянно следим за последними тенденциями и разработками в отрасли, чтобы предложить нашим клиентам самые передовые решения.
// Качество: Мы гордимся качеством нашей продукции и услуг, обеспечивая надежность и долговечность в каждом изделии.
// Обслуживание клиентов: Мы стремимся превзойти ожидания наших клиентов, предоставляя отличное обслуживание и индивидуальный подход к каждому.

// Связаться с нами:
// Мы готовы помочь вам реализовать ваши проекты. Свяжитесь с нами сегодня, и дайте нам шанс превзойти ваши ожидания.

// Подвал:
// ©[Название вашего магазина][Год].Все права защищены.
